# -*- coding: utf-8 -*-
"""
Created on Wed Jan  6 00:22:05 2021

Модуль содержит определения распространенных физических 
и астрономических констант

@author: Sergey Khaibrakhmanov
"""

# гравитационная постоянная, СГС
G     = 6.674e-8
# постоянная Больцмана, СГС
k     = 1.38e-16
# масса протона, г
m_p   = 1.67e-24
# масса Солнца, г
M_sun = 1.99e33
# астрономическая единица, см
au    = 1.5e13
# средний молекулярный вес межзвездного газа
mu    = 2.3
# число Рейнольдса
Re    = 1
# универсальная газовая постоянная в СГС
Rg = 8.31e7
