# -*- coding: utf-8 -*-
"""
Created on Wed Jan  6 00:22:05 2021

Модуль содержит определения распространенных физических 
и астрономических констант

@author: Sergey Khaibrakhmanov
"""

# гравитационная постоянная, СГС
G     = 6.674e-8
# постоянная Больцмана, СГС
k     = 1.38e-16
# масса протона, г
m_p   = 1.67e-24
# масса Солнца, г
M_sun = 1.99e33
# Радиус Солнца, см
R_sun = 6.96e10
# астрономическая единица, см
au    = 1.5e13
# средний молекулярный вес межзвездного газа
mu    = 2.3
# число Рейнольдса
Re    = 1
# универсальная газовая постоянная в СГС
Rg = 8.31e7
# парсек в см
pc = 3.086e18
# год в секундах
year = 365.0*24.0*3600.0

sigma = 5.67e-5           # g*cm-3**K-4
h = 6.626e-27             # g*cm2*s-1
c = 3e10                  # cm/s
